In [1]:
import pandas as pd
from faker import Faker

# Create an instance of the Faker class
fake = Faker()

In [2]:
data = []

# Generate dummy data for 1000 customers as a dict
for i in range(1, 1001):
    data.append({
        'customer_id': i,
        'name': fake.name(),
        'email': fake.email(),
        'address': fake.address()
    })

clients = pd.DataFrame(data)

clients.head()

,customer_id,name,email,address
0,1,Edwin Powell,lgardner@example.net,"8487 Michael Port\nChristineshire, NJ 01313"
1,2,Amanda Kelley,thompsontimothy@example.net,"1993 Jeffrey Expressway Apt. 497\nNorth James,..."
2,3,Matthew Cox,tina95@example.net,"3212 Clayton Roads\nAngelaborough, MA 27834"
3,4,Larry Gardner,danielle89@example.com,"8956 Kenneth Parkway Suite 760\nJasminefurt, N..."
4,5,Andrew Hamilton,huangjamie@example.net,"6679 Caitlyn Shoal\nNorth Benjaminborough, AR ..."

In [3]:
clients.to_csv('../clean_data/customers_clean.csv', index=0)

Now we make the customer_rental table

In [4]:
df_rental = pd.read_csv('../clean_data/rental_clean.csv')

In [5]:
customer_rental = df_rental.merge(clients, on='customer_id')
customer_rental = customer_rental[['customer_id', 'rental_id']]

In [6]:
customer_rental.head()

   customer_id  rental_id
0          130          1
1          130        746
2          459          2
3          408          3
4          408         59

In [7]:
customer_rental.to_csv('../clean_data/customer_rental_clean.csv', index=0)

In [8]:
type(customer_rental)

pandas.core.frame.DataFrame